{
    "hi_there_i_m": "Hi there, I'm ",
    "page_paragraph_first": "I'm a Frontend UI/UX developer, designer, and storyteller who thrives on building seamless digital experiences. My journey started with C# and WinForms, evolving into Node.js, React, and UI/UX design with Figma. Along the way, I explored Open Banking, mobile development with Flutter, and even video editing for promotional content.",
    "page_paragraph_second": "Whether it's crafting scalable web apps, designing intuitive interfaces, or developing AI-driven solutions like my crypto trading bot, Forenet-AI, I’m always pushing the boundaries of what’s possible.",
    "please_enter_a_valid_email": "Please enter a valid email.",
    "download_resume": "Download Resume",
    "drop_your_email_to_get_my_cv": "Drop Your Email to Get My CV",
    "want_to_check_out_my_cv": "Want to check out my CV? Just enter your email so I know who’s downloading it. Don’t worry, no spam—just keeping track!",
    "once_you_complete_the_reCAPTCHA": "🔒 Once you complete the reCAPTCHA, the 'Download CV' button will be ready to go.",
    "download": "Download",
    "my_worked_projects": "My Worked Projects",
    "hey_im_alpaslan_DOGAN_an_ever_evolving": "Hey, I’m Alpaslan DOGAN—an ever-evolving developer, passionate designer, and a storyteller through both code and visuals. My journey into the tech world began with a simple motto: “just teach me software.” Starting out, I dived into C# through pharmacy automation systems, mastering WinForms and gradually expanding into PostgreSQL and MySQL. Along the way, I worked my way up to team lead, managing a range of projects that spanned different domains.",
    "one_of_my_proudest_achievements": "One of my proudest achievements during these early years was developing Sigortacım Uzman, a WinForms application designed to simplify processes for insurance companies. This project was my introduction to ClickOnce for distribution and set the stage for many more accomplishments.",
    "as_time_passed_my_curiosity": "As time passed, my curiosity led me to Node.js and later React, where I honed my skills through countless projects. However, I quickly realized that to create truly seamless experiences, I needed to focus on design as well. This realization led me to Figma, a tool that opened new horizons for me in UI/UX design. Designing for all platforms—mobile, web, and desktop—became second nature, and my projects were better for it.",
    "my_journey_didnt_stop": "My journey didn’t stop there. I ventured into Open Banking, where I gained valuable insights into the world of financial tech. I also branched out into mobile app design, working on projects like Mibu, which led me to explore Flutter as a mobile development framework.",
    "when_i_wasnt_immersed": "When I wasn't immersed in coding and design, I started learning Adobe Premiere Pro to further enhance my creative skillset. I worked on promotional and investor videos for projects like Blendy and Visobl, and even found time to develop my own crypto trading bot, Forenet-AI.",
    "through_it_all_one_thing": "Through it all, one thing remains constant: my drive to keep learning, building, and pushing the limits of what’s possible. Whether it’s through crafting beautiful code, designing engaging interfaces, or creating compelling content, I’m always striving to improve.",
    "thanks_for_joining_me": "Thanks for joining me on this journey! Let’s continue exploring, creating, and growing together.",
    "i_m_a_frontend_ui_ux": "I'm a Frontend UI/UX developer that loves ",
    "work_history": "Work History",
    "building_products": "building products",
    "and_web_apps_that": " and web apps that can impact millions of lives",
    "for_more_details_about": "For more details about my experience and skills, feel free to download my CV.",
    "about_me": "About Me",
    "what_i_ve_been_working": "What I've been working on",
    "contact_me": "Contact Me",
    "reach_out_to_me_over": "Reach out to me over email or fill up this contact form. I will get back to you ASAP - I promise.",
    "email_is_invalid": "Email is invalid",
    "latest_push": "LATEST PUSH",
    "commits": "Commits",
    "just_now": "Just now",
    "minutes_ago": "minutes ago",
    "hours_ago": "hours ago",
    "days_ago": "days ago",
    "no_activity": "No activity today",
    "submit": "Submit",
    "your_name": "Your Name",
    "your_email_address": "Your email address",
    "your_message": "Your Message",
    "my_tech": "My Technologies...",
    "ming_app_description": "I am actively working at Ming App on an innovative platform developed using modern web technologies. In this role, I focus on building high-performance and responsive user interfaces with a strong emphasis on user experience. I work on advanced dashboard structures and dynamic, intuitive data visualizations to help users interact with and understand data more effectively. Additionally, I contribute to both the technical foundation and the overall visual quality of the product, aiming to deliver scalable, maintainable, and user-friendly solutions.",
    "i_have_been_involved_in_the_Visobl": "I have been involved in the Visobl project from the very beginning and continue to contribute actively. Throughout the project, I have taken on various roles, with a primary focus on front-end development and UI/UX design. Using React, Next.js, and multiple frameworks, I have built user-friendly interfaces and designed applications. While my main expertise lies in front-end development, I have also contributed to the backend, ensuring the overall integrity of the system.",
    "we_started_the_mibu_project": "We started the Mibu project based on an idea that was brought to us, asking how we could contribute to the emerging ChatGPT and AI ecosystem. Throughout the process, we created multiple app designs and, after finalizing the most suitable one, we moved on to development. As a result, we successfully built the application and launched it on the App Store for users to access.",
    "i_joined_the_blendy_project": "I joined the Blendy project later and primarily took on roles in design adjustments, website design, and social media management. I carried out various optimizations to enhance the user experience and strengthen the brand’s digital presence. https://blendy.app/",
    "kidsapp_is_a_personal_project": "KidsApp is a personal project I started working on with the goal of helping manage the amount of time children spend on their phones. Currently, I am working on app designs and the business model, and the project is still in the development phase.",
    "the_sigortacim_uzman": "The Sigortacım Uzman project consisted of two phases: 1. The desktop application and later 2. The web project. The desktop application was the first project I developed solo as a junior developer. I also contributed to the web project by providing various forms of support. I truly believe this project taught me a lot and was a significant milestone in my career.",
    "the_pharmacy_automation_project": "The Pharmacy Automation project was the first one that introduced me to Metadata Bilişim. The knowledge I gained from this project provided me with a significant advantage at the start of my career. It shaped my perspective on software development processes and laid a solid technical foundation for me. This experience played a crucial role in guiding my career path.",
    "i_have_contributed_to": "I have contributed to numerous projects, taking on various roles and responsibilities across different domains.",
    "web_mobile_app": "Web, Mobile app design and flows",
    "web_deployment": "Web Development",
    "ui_ux": "UI/UX development",
    "Home": "Home",
    "About": "About",
    "Resume": "Resume",
    "Projects": "Projects",
    "Contact": "Contact",
    "Social": "Links"
}